{
    "title": "Работа в симуляторе: исследование центра обработки данных",
    "shortName": "lab-9.3.4",
    "materialType": "lab",
    "description": "Центры обработки данных часто называют мозгом организации, хранящей и анализирующей данные, обеспечивая коммуникацию как внутри компании, так и клиентам, а также предоставляя инструменты, необходимые для исследований и разработок. Центр обработки данных должен быть построен таким образом, чтобы он мог безопасно и эффективно предоставлять полный спектр продуктов и услуг независимо от того, какая катастрофа может произойти. Есть много различных систем, которые входят в строительство центра обработки данных, но для в этом мы будем заниматься только о сетевой частью. \n\nЦентры обработки данных могут иметь размер от нескольких серверов до сотен или даже тысяч серверов. Независимо от размера, центр обработки данных должен быть построен с максимальной организованностью, чтобы упростить управление и устранение неполадок в сложной среде. Другой конструктивной особенностью является повышение надежности центра обработки данных за счет использования избыточности для устранения любой единственной точки отказа. Это может включать добавление дополнительных устройств для обеспечения физического резервирования и/или использование таких технологий, как протоколы резервирования первого перехода (FHRP) и агрегация каналов для обеспечения логической избыточности.\n\nВ этом задании в режиме симуляции физического оборудования (PTPM) большинство устройств в центрах обработки данных в городах Toronto и Seattle уже развернуты и настроены. Вы только что были наняты для ревизии текущей реализации и расширения возможностей центра обработки данных 1 в Toronto.\n\n**Примечание**: Пожалуйста, будьте терпеливы. Загрузка этого задания PTPM может занять несколько минут.",
    "difficulty": 1,
    "duration": "PT0H22M",
    "tags": [
        "Cisco",
        "Packet Tracer"
    ],
    "credentialsSchema": {
        "userName": {
            "title": "Имя пользователя",
            "source": "learn_user"
        },
        "password": {
            "title": "Пароль",
            "source": "learn_password"
        },
        "consoleURL": {
            "title": "Адрес портала",
            "value": "https://portal.skillscloud.company"
        }
    },
    "skills": {},
    "testProjectPath": "./README.md",
    "deploymentPath": "deploy",
    "assetsPath": "assets"
}